# --------------------------------- Задача 4. -------------------------------- #
# Напишете програма на Python, която намира най-дългата последователност от
# еднакви елементи в списък. Ако има няколко такива редици с еднаква дължина,
# върнете първата срещната.
# Пример:
#     дадено: numbers=[2, 1, 1, 2, 3, 3, 2, 2, 2, 1],       изход:  [2, 2, 2]
#     дадено: numbers=[4, 4, 2, 2, 2, 3, 3, 1, 4, 4, 4],    изход:  [2, 2, 2]

# YOUR CODE HERE


def find_similar(list_of_numbers):
    """
    input: [4, 4, 2, 2, 2, 3, 3, 1, 4, 4, 4, 5]
    similar_lists: [
        [4,4],
        [2,2,2]
        [3,3]
        [4,4,4]
    ]
    """

    similar_lists = []

    for idx in range(0, len(list_of_numbers) - 1):
        if list_of_numbers[idx] == list_of_numbers[idx + 1]:
            buffer = []
            # buffer.append()
